"""

Домашнее задание №1

Цикл for: Продажи товаров

* Дан список словарей с данными по колличеству проданных телефонов
  [
    {'product': 'iPhone 12', 'items_sold': [363, 500, 224, 358, 480, 476, 470, 216, 270, 388, 312, 186]}, 
    {'product': 'Xiaomi Mi11', 'items_sold': [317, 267, 290, 431, 211, 354, 276, 526, 141, 453, 510, 316]},
    {'product': 'Samsung Galaxy 21', 'items_sold': [343, 390, 238, 437, 214, 494, 441, 518, 212, 288, 272, 247]},
  ]
* Посчитать и вывести суммарное количество продаж для каждого товара
* Посчитать и вывести среднее количество продаж для каждого товара
* Посчитать и вывести суммарное количество продаж всех товаров
* Посчитать и вывести среднее количество продаж всех товаров
"""
mydict =  [
    {'product': 'iPhone 12', 'items_sold': [363, 500, 224, 358, 480, 476, 470, 216, 270, 388, 312, 186]}, 
    {'product': 'Xiaomi Mi11', 'items_sold': [317, 267, 290, 431, 211, 354, 276, 526, 141, 453, 510, 316]},
    {'product': 'Samsung Galaxy 21', 'items_sold': [343, 390, 238, 437, 214, 494, 441, 518, 212, 288, 272, 247]},
  ] # инициализация словаря , запись в переменную.

for price in mydict:
 total_items_sold = sum(price['items_sold'])

 print (f"суммарное количество продаж для {price['product']} ")
 print ("--------------------------------------------------------") # для ну хоть какой то читаемости результата.
 print(f"{price['product']} {total_items_sold}") # f строка позволяет сочетать стринговые значения и переменные.

 print ("--------------------------------------------------------")
for price in mydict:
  sr_item_solid = sum(price['items_sold'])/ len(price['items_sold'])
  print (f"среднее количество продаж для {price['product']} ")
  print ("--------------------------------------------------------")
  print(f"{price['product']} {sr_item_solid}") # f строка позволяет сочетать стринговые значения и переменные.  
  print ("--------------------------------------------------------")  
all_sales = []

for price in mydict:
   all_sales.extend(price['items_sold']) # Добавление в массив all_sales знчений items_sold по циклу из словаря mydict
sum_All_solid = sum(all_sales)
  

print(f"суммарное Общее количество продаж всех товаров {sum_All_solid}")
print ("--------------------------------------------------------")  

for price in mydict:
   sr_all_items_solid = sum_All_solid/len(all_sales)
print(f"суммарное среднее количество продаж всех товаров {sr_all_items_solid}")
print ("--------------------------------------------------------") 

def main():
    """
    Эта функция вызывается автоматически при запуске скрипта в консоли
    В ней надо заменить pass на ваш код
    """
    pass
    
if __name__ == "__main__":
    main()
